MikroElektronika/core_packages/PIC/XC8/def/PIC18F46J53/mcu.h
// Generated 05/01/2024 GMT

/*
 * Copyright © 2024, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F46J53_H_
#define _PIC18F46J53_H_

/*
 * C Header file for the Microchip PIC Microcontroller
 * PIC18F46J53
 */
#ifndef _XC_H_
#warning Header file pic18f46j53.h included directly. Use #include <xc.h> instead.
#endif

#include <__at.h>

/*
 * Register Definitions
 */

// Register: ADCTRIG
#define ADCTRIG ADCTRIG
extern volatile unsigned char           ADCTRIG             __at(0xEB8);
#ifndef _LIB_BUILD
asm("ADCTRIG equ 0EB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRIGSEL                :2;
    };
    struct {
        unsigned SRC0                   :1;
        unsigned SRC1                   :1;
    };
    struct {
        unsigned TRIGSEL0               :1;
        unsigned TRIGSEL1               :1;
    };
    struct {
        unsigned SRC                    :2;
    };
} ADCTRIGbits_t;
extern volatile ADCTRIGbits_t ADCTRIGbits __at(0xEB8);
// bitfield macros
#define _ADCTRIG_TRIGSEL_POSN                               0x0
#define _ADCTRIG_TRIGSEL_POSITION                           0x0
#define _ADCTRIG_TRIGSEL_SIZE                               0x2
#define _ADCTRIG_TRIGSEL_LENGTH                             0x2
#define _ADCTRIG_TRIGSEL_MASK                               0x3
#define _ADCTRIG_SRC0_POSN                                  0x0
#define _ADCTRIG_SRC0_POSITION                              0x0
#define _ADCTRIG_SRC0_SIZE                                  0x1
#define _ADCTRIG_SRC0_LENGTH                                0x1
#define _ADCTRIG_SRC0_MASK                                  0x1
#define _ADCTRIG_SRC1_POSN                                  0x1
#define _ADCTRIG_SRC1_POSITION                              0x1
#define _ADCTRIG_SRC1_SIZE                                  0x1
#define _ADCTRIG_SRC1_LENGTH                                0x1
#define _ADCTRIG_SRC1_MASK                                  0x2
#define _ADCTRIG_TRIGSEL0_POSN                              0x0
#define _ADCTRIG_TRIGSEL0_POSITION                          0x0
#define _ADCTRIG_TRIGSEL0_SIZE                              0x1
#define _ADCTRIG_TRIGSEL0_LENGTH                            0x1
#define _ADCTRIG_TRIGSEL0_MASK                              0x1
#define _ADCTRIG_TRIGSEL1_POSN                              0x1
#define _ADCTRIG_TRIGSEL1_POSITION                          0x1
#define _ADCTRIG_TRIGSEL1_SIZE                              0x1
#define _ADCTRIG_TRIGSEL1_LENGTH                            0x1
#define _ADCTRIG_TRIGSEL1_MASK                              0x2
#define _ADCTRIG_SRC_POSN                                   0x0
#define _ADCTRIG_SRC_POSITION                               0x0
#define _ADCTRIG_SRC_SIZE                                   0x2
#define _ADCTRIG_SRC_LENGTH                                 0x2
#define _ADCTRIG_SRC_MASK                                   0x3

// Register: PMDIS0
#define PMDIS0 PMDIS0
extern volatile unsigned char           PMDIS0              __at(0xEB9);
#ifndef _LIB_BUILD
asm("PMDIS0 equ 0EB9h");
#endif
// aliases
extern volatile unsigned char           PD0                 __at(0xEB9);
#ifndef _LIB_BUILD
asm("PD0 equ 0EB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCMD                  :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
        unsigned UART1MD                :1;
        unsigned UART2MD                :1;
        unsigned ECCP1MD                :1;
        unsigned ECCP2MD                :1;
        unsigned ECCP3MD                :1;
    };
    struct {
        unsigned                        :1;
        unsigned PMDMSSP1               :1;
        unsigned PMDMSSP2               :1;
        unsigned PMDUART1               :1;
        unsigned PMDUART2               :1;
        unsigned PMDECCP1               :1;
        unsigned PMDECCP2               :1;
        unsigned PMDECCP3               :1;
    };
    struct {
        unsigned PMDADC                 :1;
        unsigned PMDMSSP                :2;
        unsigned PMDUART                :2;
        unsigned PMDECCP                :3;
    };
    struct {
        unsigned                        :1;
        unsigned SPIMD                  :2;
        unsigned UARTMD                 :2;
        unsigned ECCPMD                 :3;
    };
} PMDIS0bits_t;
extern volatile PMDIS0bits_t PMDIS0bits __at(0xEB9);
// bitfield macros
#define _PMDIS0_ADCMD_POSN                                  0x0
#define _PMDIS0_ADCMD_POSITION                              0x0
#define _PMDIS0_ADCMD_SIZE                                  0x1
#define _PMDIS0_ADCMD_LENGTH                                0x1
#define _PMDIS0_ADCMD_MASK                                  0x1
#define _PMDIS0_SPI1MD_POSN                                 0x1
#define _PMDIS0_SPI1MD_POSITION                             0x1
#define _PMDIS0_SPI1MD_SIZE                                 0x1
#define _PMDIS0_SPI1MD_LENGTH                               0x1
#define _PMDIS0_SPI1MD_MASK                                 0x2
#define _PMDIS0_SPI2MD_POSN                                 0x2
#define _PMDIS0_SPI2MD_POSITION                             0x2
#define _PMDIS0_SPI2MD_SIZE                                 0x1
#define _PMDIS0_SPI2MD_LENGTH                               0x1
#define _PMDIS0_SPI2MD_MASK                                 0x4
#define _PMDIS0_UART1MD_POSN                                0x3
#define _PMDIS0_UART1MD_POSITION                            0x3
#define _PMDIS0_UART1MD_SIZE                                0x1
#define _PMDIS0_UART1MD_LENGTH                              0x1
#define _PMDIS0_UART1MD_MASK                                0x8
#define _PMDIS0_UART2MD_POSN                                0x4
#define _PMDIS0_UART2MD_POSITION                            0x4
#define _PMDIS0_UART2MD_SIZE                                0x1
#define _PMDIS0_UART2MD_LENGTH                              0x1
#define _PMDIS0_UART2MD_MASK                                0x10
#define _PMDIS0_ECCP1MD_POSN                                0x5
#define _PMDIS0_ECCP1MD_POSITION                            0x5
#define _PMDIS0_ECCP1MD_SIZE                                0x1
#define _PMDIS0_ECCP1MD_LENGTH                              0x1
#define _PMDIS0_ECCP1MD_MASK                                0x20
#define _PMDIS0_ECCP2MD_POSN                                0x6
#define _PMDIS0_ECCP2MD_POSITION                            0x6
#define _PMDIS0_ECCP2MD_SIZE                                0x1
#define _PMDIS0_ECCP2MD_LENGTH                              0x1
#define _PMDIS0_ECCP2MD_MASK                                0x40
#define _PMDIS0_ECCP3MD_POSN                                0x7
#define _PMDIS0_ECCP3MD_POSITION                            0x7
#define _PMDIS0_ECCP3MD_SIZE                                0x1
#define _PMDIS0_ECCP3MD_LENGTH                              0x1
#define _PMDIS0_ECCP3MD_MASK                                0x80
#define _PMDIS0_PMDMSSP1_POSN                               0x1
#define _PMDIS0_PMDMSSP1_POSITION                           0x1
#define _PMDIS0_PMDMSSP1_SIZE                               0x1
#define _PMDIS0_PMDMSSP1_LENGTH                             0x1
#define _PMDIS0_PMDMSSP1_MASK                               0x2
#define _PMDIS0_PMDMSSP2_POSN                               0x2
#define _PMDIS0_PMDMSSP2_POSITION                           0x2
#define _PMDIS0_PMDMSSP2_SIZE                               0x1
#define _PMDIS0_PMDMSSP2_LENGTH                             0x1
#define _PMDIS0_PMDMSSP2_MASK                               0x4
#define _PMDIS0_PMDUART1_POSN                               0x3
#define _PMDIS0_PMDUART1_POSITION                           0x3
#define _PMDIS0_PMDUART1_SIZE                               0x1
#define _PMDIS0_PMDUART1_LENGTH                             0x1
#define _PMDIS0_PMDUART1_MASK                               0x8
#define _PMDIS0_PMDUART2_POSN                               0x4
#define _PMDIS0_PMDUART2_POSITION                           0x4
#define _PMDIS0_PMDUART2_SIZE                               0x1
#define _PMDIS0_PMDUART2_LENGTH                             0x1
#define _PMDIS0_PMDUART2_MASK                               0x10
#define _PMDIS0_PMDECCP1_POSN                               0x5
#define _PMDIS0_PMDECCP1_POSITION                           0x5
#define _PMDIS0_PMDECCP1_SIZE                               0x1
#define _PMDIS0_PMDECCP1_LENGTH                             0x1
#define _PMDIS0_PMDECCP1_MASK                               0x20
#define _PMDIS0_PMDECCP2_POSN                               0x6
#define _PMDIS0_PMDECCP2_POSITION                           0x6
#define _PMDIS0_PMDECCP2_SIZE                               0x1
#define _PMDIS0_PMDECCP2_LENGTH                             0x1
#define _PMDIS0_PMDECCP2_MASK                               0x40
#define _PMDIS0_PMDECCP3_POSN                               0x7
#define _PMDIS0_PMDECCP3_POSITION                           0x7
#define _PMDIS0_PMDECCP3_SIZE                               0x1
#define _PMDIS0_PMDECCP3_LENGTH                             0x1
#define _PMDIS0_PMDECCP3_MASK                               0x80
#define _PMDIS0_PMDADC_POSN                                 0x0
#define _PMDIS0_PMDADC_POSITION                             0x0
#define _PMDIS0_PMDADC_SIZE                                 0x1
#define _PMDIS0_PMDADC_LENGTH                               0x1
#define _PMDIS0_PMDADC_MASK                                 0x1
#define _PMDIS0_PMDMSSP_POSN                                0x1
#define _PMDIS0_PMDMSSP_POSITION                            0x1
#define _PMDIS0_PMDMSSP_SIZE                                0x2
#define _PMDIS0_PMDMSSP_LENGTH                              0x2
#define _PMDIS0_PMDMSSP_MASK                                0x6
#define _PMDIS0_PMDUART_POSN                                0x3
#define _PMDIS0_PMDUART_POSITION                            0x3
#define _PMDIS0_PMDUART_SIZE                                0x2
#define _PMDIS0_PMDUART_LENGTH                              0x2
#define _PMDIS0_PMDUART_MASK                                0x18
#define _PMDIS0_PMDECCP_POSN                                0x5
#define _PMDIS0_PMDECCP_POSITION                            0x5
#define _PMDIS0_PMDECCP_SIZE                                0x3
#define _PMDIS0_PMDECCP_LENGTH                              0x3
#define _PMDIS0_PMDECCP_MASK                                0xE0
#define _PMDIS0_SPIMD_POSN                                  0x1
#define _PMDIS0_SPIMD_POSITION                              0x1
#define _PMDIS0_SPIMD_SIZE                                  0x2
#define _PMDIS0_SPIMD_LENGTH                                0x2
#define _PMDIS0_SPIMD_MASK                                  0x6
#define _PMDIS0_UARTMD_POSN                                 0x3
#define _PMDIS0_UARTMD_POSITION                             0x3
#define _PMDIS0_UARTMD_SIZE                                 0x2
#define _PMDIS0_UARTMD_LENGTH                               0x2
#define _PMDIS0_UARTMD_MASK                                 0x18
#define _PMDIS0_ECCPMD_POSN                                 0x5
#define _PMDIS0_ECCPMD_POSITION                             0x5
#define _PMDIS0_ECCPMD_SIZE                                 0x3
#define _PMDIS0_ECCPMD_LENGTH                               0x3
#define _PMDIS0_ECCPMD_MASK                                 0xE0
// alias bitfield definitions
typedef union {
    struct {
        unsigned ADCMD                  :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
        unsigned UART1MD                :1;
        unsigned UART2MD                :1;
        unsigned ECCP1MD                :1;
        unsigned ECCP2MD                :1;
        unsigned ECCP3MD                :1;
    };
    struct {
        unsigned                        :1;
        unsigned PMDMSSP1               :1;
        unsigned PMDMSSP2               :1;
        unsigned PMDUART1               :1;
        unsigned PMDUART2               :1;
        unsigned PMDECCP1               :1;
        unsigned PMDECCP2               :1;
        unsigned PMDECCP3               :1;
    };
    struct {
        unsigned PMDADC                 :1;
        unsigned PMDMSSP                :2;
        unsigned PMDUART                :2;
        unsigned PMDECCP                :3;
    };
    struct {
        unsigned                        :1;
        unsigned SPIMD                  :2;
        unsigned UARTMD                 :2;
        unsigned ECCPMD                 :3;
    };
} PD0bits_t;
extern volatile PD0bits_t PD0bits __at(0xEB9);
// bitfield macros
#define _PD0_ADCMD_POSN                                     0x0
#define _PD0_ADCMD_POSITION                                 0x0
#define _PD0_ADCMD_SIZE                                     0x1
#define _PD0_ADCMD_LENGTH                                   0x1
#define _PD0_ADCMD_MASK                                     0x1
#define _PD0_SPI1MD_POSN                                    0x1
#define _PD0_SPI1MD_POSITION                                0x1
#define _PD0_SPI1MD_SIZE                                    0x1
#define _PD0_SPI1MD_LENGTH                                  0x1
#define _PD0_SPI1MD_MASK                                    0x2
#define _PD0_SPI2MD_POSN                                    0x2
#define _PD0_SPI2MD_POSITION                                0x2
#define _PD0_SPI2MD_SIZE                                    0x1
#define _PD0_SPI2MD_LENGTH                                  0x1
#define _PD0_SPI2MD_MASK                                    0x4
#define _PD0_UART1MD_POSN                                   0x3
#define _PD0_UART1MD_POSITION                               0x3
#define _PD0_UART1MD_SIZE                                   0x1
#define _PD0_UART1MD_LENGTH                                 0x1
#define _PD0_UART1MD_MASK                                   0x8
#define _PD0_UART2MD_POSN                                   0x4
#define _PD0_UART2MD_POSITION                               0x4
#define _PD0_UART2MD_SIZE                                   0x1
#define _PD0_UART2MD_LENGTH                                 0x1
#define _PD0_UART2MD_MASK                                   0x10
#define _PD0_ECCP1MD_POSN                                   0x5
#define _PD0_ECCP1MD_POSITION                               0x5
#define _PD0_ECCP1MD_SIZE                                   0x1
#define _PD0_ECCP1MD_LENGTH                                 0x1
#define _PD0_ECCP1MD_MASK                                   0x20
#define _PD0_ECCP2MD_POSN                                   0x6
#define _PD0_ECCP2MD_POSITION                               0x6
#define _PD0_ECCP2MD_SIZE                                   0x1
#define _PD0_ECCP2MD_LENGTH                                 0x1
#define _PD0_ECCP2MD_MASK                                   0x40
#define _PD0_ECCP3MD_POSN                                   0x7
#define _PD0_ECCP3MD_POSITION                               0x7
#define _PD0_ECCP3MD_SIZE                                   0x1
#define _PD0_ECCP3MD_LENGTH                                 0x1
#define _PD0_ECCP3MD_MASK                                   0x80
#define _PD0_PMDMSSP1_POSN                                  0x1
#define _PD0_PMDMSSP1_POSITION                              0x1
#define _PD0_PMDMSSP1_SIZE                                  0x1
#define _PD0_PMDMSSP1_LENGTH                                0x1
#define _PD0_PMDMSSP1_MASK                                  0x2
#define _PD0_PMDMSSP2_POSN                                  0x2
#define _PD0_PMDMSSP2_POSITION                              0x2
#define _PD0_PMDMSSP2_SIZE                                  0x1
#define _PD0_PMDMSSP2_LENGTH                                0x1
#define _PD0_PMDMSSP2_MASK                                  0x4
#define _PD0_PMDUART1_POSN                                  0x3
#define _PD0_PMDUART1_POSITION                              0x3
#define _PD0_PMDUART1_SIZE                                  0x1
#define _PD0_PMDUART1_LENGTH                                0x1
#define _PD0_PMDUART1_MASK                                  0x8
#define _PD0_PMDUART2_POSN                                  0x4
#define _PD0_PMDUART2_POSITION                              0x4
#define _PD0_PMDUART2_SIZE                                  0x1
#define _PD0_PMDUART2_LENGTH                                0x1
#define _PD0_PMDUART2_MASK                                  0x10
#define _PD0_PMDECCP1_POSN                                  0x5
#define _PD0_PMDECCP1_POSITION                              0x5
#define _PD0_PMDECCP1_SIZE                                  0x1
#define _PD0_PMDECCP1_LENGTH                                0x1
#define _PD0_PMDECCP1_MASK                                  0x20
#define _PD0_PMDECCP2_POSN                                  0x6
#define _PD0_PMDECCP2_POSITION                              0x6
#define _PD0_PMDECCP2_SIZE                                  0x1
#define _PD0_PMDECCP2_LENGTH                                0x1
#define _PD0_PMDECCP2_MASK                                  0x40
#define _PD0_PMDECCP3_POSN                                  0x7
#define _PD0_PMDECCP3_POSITION                              0x7
#define _PD0_PMDECCP3_SIZE                                  0x1
#define _PD0_PMDECCP3_LENGTH                                0x1
#define _PD0_PMDECCP3_MASK                                  0x80
#define _PD0_PMDADC_POSN                                    0x0
#define _PD0_PMDADC_POSITION                                0x0
#define _PD0_PMDADC_SIZE                                    0x1
#define _PD0_PMDADC_LENGTH                                  0x1
#define _PD0_PMDADC_MASK                                    0x1
#define _PD0_PMDMSSP_POSN                                   0x1
#define _PD0_PMDMSSP_POSITION                               0x1
#define _PD0_PMDMSSP_SIZE                                   0x2
#define _PD0_PMDMSSP_LENGTH                                 0x2
#define _PD0_PMDMSSP_MASK                                   0x6
#define _PD0_PMDUART_POSN                                   0x3
#define _PD0_PMDUART_POSITION                               0x3
#define _PD0_PMDUART_SIZE                                   0x2
#define _PD0_PMDUART_LENGTH                                 0x2
#define _PD0_PMDUART_MASK                                   0x18
#define _PD0_PMDECCP_POSN                                   0x5
#define _PD0_PMDECCP_POSITION                               0x5
#define _PD0_PMDECCP_SIZE                                   0x3
#define _PD0_PMDECCP_LENGTH                                 0x3
#define _PD0_PMDECCP_MASK                                   0xE0
#define _PD0_SPIMD_POSN                                     0x1
#define _PD0_SPIMD_POSITION                                 0x1
#define _PD0_SPIMD_SIZE                                     0x2
#define _PD0_SPIMD_LENGTH                                   0x2
#define _PD0_SPIMD_MASK                                     0x6
#define _PD0_UARTMD_POSN                                    0x3
#define _PD0_UARTMD_POSITION                                0x3
#define _PD0_UARTMD_SIZE                                    0x2
#define _PD0_UARTMD_LENGTH                                  0x2
#define _PD0_UARTMD_MASK                                    0x18
#define _PD0_ECCPMD_POSN                                    0x5
#define _PD0_ECCPMD_POSITION                                0x5
#define _PD0_ECCPMD_SIZE                                    0x3
#define _PD0_ECCPMD_LENGTH                                  0x3
#define _PD0_ECCPMD_MASK                                    0xE0

// Register: PMDIS1
#define PMDIS1 PMDIS1
extern volatile unsigned char           PMDIS1              __at(0xEBA);
#ifndef _LIB_BUILD
asm("PMDIS1 equ 0EBAh");
#endif
// aliases
extern volatile unsigned char           PD1                 __at(0xEBA);
#ifndef _LIB_BUILD
asm("PD1 equ 0EBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned RTCCMD                 :1;
        unsigned CTMUMD                 :1;
        unsigned PSPMD                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned PMDTMR1                :1;
        unsigned PMDTMR2                :1;
        unsigned PMDTMR3                :1;
        unsigned PMDTMR4                :1;
    };
    struct {
        unsigned                        :1;
        unsigned PMDTMR                 :4;
        unsigned PMDRTCC                :1;
        unsigned PMDCTMU                :1;
        unsigned PMDPSP                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned TMRMD                  :4;
    };
} PMDIS1bits_t;
