MikroElektronika/core_packages/PIC/XC8/def/PIC18F46J53/mcu.h
// Register: PMSTATH
#define PMSTATH PMSTATH
extern volatile unsigned char           PMSTATH             __at(0xF55);
#ifndef _LIB_BUILD
asm("PMSTATH equ 0F55h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IB0F                   :1;
        unsigned IB1F                   :1;
        unsigned IB2F                   :1;
        unsigned IB3F                   :1;
        unsigned                        :2;
        unsigned IBOV                   :1;
        unsigned IBF                    :1;
    };
} PMSTATHbits_t;
extern volatile PMSTATHbits_t PMSTATHbits __at(0xF55);
// bitfield macros
#define _PMSTATH_IB0F_POSN                                  0x0
#define _PMSTATH_IB0F_POSITION                              0x0
#define _PMSTATH_IB0F_SIZE                                  0x1
#define _PMSTATH_IB0F_LENGTH                                0x1
#define _PMSTATH_IB0F_MASK                                  0x1
#define _PMSTATH_IB1F_POSN                                  0x1
#define _PMSTATH_IB1F_POSITION                              0x1
#define _PMSTATH_IB1F_SIZE                                  0x1
#define _PMSTATH_IB1F_LENGTH                                0x1
#define _PMSTATH_IB1F_MASK                                  0x2
#define _PMSTATH_IB2F_POSN                                  0x2
#define _PMSTATH_IB2F_POSITION                              0x2
#define _PMSTATH_IB2F_SIZE                                  0x1
#define _PMSTATH_IB2F_LENGTH                                0x1
#define _PMSTATH_IB2F_MASK                                  0x4
#define _PMSTATH_IB3F_POSN                                  0x3
#define _PMSTATH_IB3F_POSITION                              0x3
#define _PMSTATH_IB3F_SIZE                                  0x1
#define _PMSTATH_IB3F_LENGTH                                0x1
#define _PMSTATH_IB3F_MASK                                  0x8
#define _PMSTATH_IBOV_POSN                                  0x6
#define _PMSTATH_IBOV_POSITION                              0x6
#define _PMSTATH_IBOV_SIZE                                  0x1
#define _PMSTATH_IBOV_LENGTH                                0x1
#define _PMSTATH_IBOV_MASK                                  0x40
#define _PMSTATH_IBF_POSN                                   0x7
#define _PMSTATH_IBF_POSITION                               0x7
#define _PMSTATH_IBF_SIZE                                   0x1
#define _PMSTATH_IBF_LENGTH                                 0x1
#define _PMSTATH_IBF_MASK                                   0x80

// Register: PMEL
#define PMEL PMEL
extern volatile unsigned char           PMEL                __at(0xF56);
#ifndef _LIB_BUILD
asm("PMEL equ 0F56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PTENL                  :8;
    };
    struct {
        unsigned PTEN0                  :1;
        unsigned PTEN1                  :1;
        unsigned PTEN2                  :1;
        unsigned PTEN3                  :1;
        unsigned PTEN4                  :1;
        unsigned PTEN5                  :1;
        unsigned PTEN6                  :1;
        unsigned PTEN7                  :1;
    };
} PMELbits_t;
extern volatile PMELbits_t PMELbits __at(0xF56);
// bitfield macros
#define _PMEL_PTENL_POSN                                    0x0
#define _PMEL_PTENL_POSITION                                0x0
#define _PMEL_PTENL_SIZE                                    0x8
#define _PMEL_PTENL_LENGTH                                  0x8
#define _PMEL_PTENL_MASK                                    0xFF
#define _PMEL_PTEN0_POSN                                    0x0
#define _PMEL_PTEN0_POSITION                                0x0
#define _PMEL_PTEN0_SIZE                                    0x1
#define _PMEL_PTEN0_LENGTH                                  0x1
#define _PMEL_PTEN0_MASK                                    0x1
#define _PMEL_PTEN1_POSN                                    0x1
#define _PMEL_PTEN1_POSITION                                0x1
#define _PMEL_PTEN1_SIZE                                    0x1
#define _PMEL_PTEN1_LENGTH                                  0x1
#define _PMEL_PTEN1_MASK                                    0x2
#define _PMEL_PTEN2_POSN                                    0x2
#define _PMEL_PTEN2_POSITION                                0x2
#define _PMEL_PTEN2_SIZE                                    0x1
#define _PMEL_PTEN2_LENGTH                                  0x1
#define _PMEL_PTEN2_MASK                                    0x4
#define _PMEL_PTEN3_POSN                                    0x3
#define _PMEL_PTEN3_POSITION                                0x3
#define _PMEL_PTEN3_SIZE                                    0x1
#define _PMEL_PTEN3_LENGTH                                  0x1
#define _PMEL_PTEN3_MASK                                    0x8
#define _PMEL_PTEN4_POSN                                    0x4
#define _PMEL_PTEN4_POSITION                                0x4
#define _PMEL_PTEN4_SIZE                                    0x1
#define _PMEL_PTEN4_LENGTH                                  0x1
#define _PMEL_PTEN4_MASK                                    0x10
#define _PMEL_PTEN5_POSN                                    0x5
#define _PMEL_PTEN5_POSITION                                0x5
#define _PMEL_PTEN5_SIZE                                    0x1
#define _PMEL_PTEN5_LENGTH                                  0x1
#define _PMEL_PTEN5_MASK                                    0x20
#define _PMEL_PTEN6_POSN                                    0x6
#define _PMEL_PTEN6_POSITION                                0x6
#define _PMEL_PTEN6_SIZE                                    0x1
#define _PMEL_PTEN6_LENGTH                                  0x1
#define _PMEL_PTEN6_MASK                                    0x40
#define _PMEL_PTEN7_POSN                                    0x7
#define _PMEL_PTEN7_POSITION                                0x7
#define _PMEL_PTEN7_SIZE                                    0x1
#define _PMEL_PTEN7_LENGTH                                  0x1
#define _PMEL_PTEN7_MASK                                    0x80

// Register: PMEH
#define PMEH PMEH
extern volatile unsigned char           PMEH                __at(0xF57);
#ifndef _LIB_BUILD
asm("PMEH equ 0F57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PTENH                  :8;
    };
    struct {
        unsigned PTEN8                  :1;
        unsigned PTEN9                  :1;
        unsigned PTEN10                 :1;
        unsigned PTEN11                 :1;
        unsigned PTEN12                 :1;
        unsigned PTEN13                 :1;
        unsigned PTEN14                 :1;
        unsigned PTEN15                 :1;
    };
} PMEHbits_t;
extern volatile PMEHbits_t PMEHbits __at(0xF57);
// bitfield macros
#define _PMEH_PTENH_POSN                                    0x0
#define _PMEH_PTENH_POSITION                                0x0
#define _PMEH_PTENH_SIZE                                    0x8
#define _PMEH_PTENH_LENGTH                                  0x8
#define _PMEH_PTENH_MASK                                    0xFF
#define _PMEH_PTEN8_POSN                                    0x0
#define _PMEH_PTEN8_POSITION                                0x0
#define _PMEH_PTEN8_SIZE                                    0x1
#define _PMEH_PTEN8_LENGTH                                  0x1
#define _PMEH_PTEN8_MASK                                    0x1
#define _PMEH_PTEN9_POSN                                    0x1
#define _PMEH_PTEN9_POSITION                                0x1
#define _PMEH_PTEN9_SIZE                                    0x1
#define _PMEH_PTEN9_LENGTH                                  0x1
#define _PMEH_PTEN9_MASK                                    0x2
#define _PMEH_PTEN10_POSN                                   0x2
#define _PMEH_PTEN10_POSITION                               0x2
#define _PMEH_PTEN10_SIZE                                   0x1
#define _PMEH_PTEN10_LENGTH                                 0x1
#define _PMEH_PTEN10_MASK                                   0x4
#define _PMEH_PTEN11_POSN                                   0x3
#define _PMEH_PTEN11_POSITION                               0x3
#define _PMEH_PTEN11_SIZE                                   0x1
#define _PMEH_PTEN11_LENGTH                                 0x1
#define _PMEH_PTEN11_MASK                                   0x8
#define _PMEH_PTEN12_POSN                                   0x4
#define _PMEH_PTEN12_POSITION                               0x4
#define _PMEH_PTEN12_SIZE                                   0x1
#define _PMEH_PTEN12_LENGTH                                 0x1
#define _PMEH_PTEN12_MASK                                   0x10
#define _PMEH_PTEN13_POSN                                   0x5
#define _PMEH_PTEN13_POSITION                               0x5
#define _PMEH_PTEN13_SIZE                                   0x1
#define _PMEH_PTEN13_LENGTH                                 0x1
#define _PMEH_PTEN13_MASK                                   0x20
#define _PMEH_PTEN14_POSN                                   0x6
#define _PMEH_PTEN14_POSITION                               0x6
#define _PMEH_PTEN14_SIZE                                   0x1
#define _PMEH_PTEN14_LENGTH                                 0x1
#define _PMEH_PTEN14_MASK                                   0x40
#define _PMEH_PTEN15_POSN                                   0x7
#define _PMEH_PTEN15_POSITION                               0x7
#define _PMEH_PTEN15_SIZE                                   0x1
#define _PMEH_PTEN15_LENGTH                                 0x1
#define _PMEH_PTEN15_MASK                                   0x80

// Register: PMDIN2L
#define PMDIN2L PMDIN2L
extern volatile unsigned char           PMDIN2L             __at(0xF58);
#ifndef _LIB_BUILD
asm("PMDIN2L equ 0F58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DATAL                  :8;
    };
} PMDIN2Lbits_t;
