MikroElektronika/core_packages/PIC/XC8/def/PIC18F46J53/mcu.h
#define                                 PMA0_bit            _BIT_ACCESS(PORTB,5)
// PORTB<PMA1>
extern volatile __bit                   PMA1                __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 PMA1_bit            _BIT_ACCESS(PORTB,4)
// PORTB<PMA2>
extern volatile __bit                   PMA2                __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 PMA2_bit            _BIT_ACCESS(PORTB,3)
// PORTB<PMA3>
extern volatile __bit                   PMA3                __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 PMA3_bit            _BIT_ACCESS(PORTB,2)
// PORTC<PMA4>
extern volatile __bit                   PMA4                __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 PMA4_bit            _BIT_ACCESS(PORTC,7)
// PORTC<PMA5>
extern volatile __bit                   PMA5                __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 PMA5_bit            _BIT_ACCESS(PORTC,6)
// PORTA<PMA6>
extern volatile __bit                   PMA6                __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 PMA6_bit            _BIT_ACCESS(PORTA,0)
// PORTA<PMA7>
extern volatile __bit                   PMA7                __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 PMA7_bit            _BIT_ACCESS(PORTA,1)
// PORTB<PMBE>
extern volatile __bit                   PMBE                __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 PMBE_bit            _BIT_ACCESS(PORTB,1)
// PORTE<PMCS>
extern volatile __bit                   PMCS                __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 PMCS_bit            _BIT_ACCESS(PORTE,2)
// PORTD<PMD0>
extern volatile __bit                   PMD0                __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 PMD0_bit            _BIT_ACCESS(PORTD,0)
// PORTD<PMD1>
extern volatile __bit                   PMD1                __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 PMD1_bit            _BIT_ACCESS(PORTD,1)
// PORTD<PMD2>
extern volatile __bit                   PMD2                __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 PMD2_bit            _BIT_ACCESS(PORTD,2)
// PORTD<PMD3>
extern volatile __bit                   PMD3                __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 PMD3_bit            _BIT_ACCESS(PORTD,3)
// PORTD<PMD4>
extern volatile __bit                   PMD4                __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 PMD4_bit            _BIT_ACCESS(PORTD,4)
// PORTD<PMD5>
extern volatile __bit                   PMD5                __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 PMD5_bit            _BIT_ACCESS(PORTD,5)
// PORTD<PMD6>
extern volatile __bit                   PMD6                __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 PMD6_bit            _BIT_ACCESS(PORTD,6)
// PORTD<PMD7>
extern volatile __bit                   PMD7                __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 PMD7_bit            _BIT_ACCESS(PORTD,7)
// PMDIS0<PMDADC>
extern volatile __bit                   PMDADC              __at(0x75C8);	// @ (0xEB9 * 8 + 0)
#define                                 PMDADC_bit          _BIT_ACCESS(PMDIS0,0)
// PMDIS3<PMDCCP10>
extern volatile __bit                   PMDCCP10            __at(0x75E7);	// @ (0xEBC * 8 + 7)
#define                                 PMDCCP10_bit        _BIT_ACCESS(PMDIS3,7)
// PMDIS3<PMDCCP4>
extern volatile __bit                   PMDCCP4             __at(0x75E1);	// @ (0xEBC * 8 + 1)
#define                                 PMDCCP4_bit         _BIT_ACCESS(PMDIS3,1)
// PMDIS3<PMDCCP5>
extern volatile __bit                   PMDCCP5             __at(0x75E2);	// @ (0xEBC * 8 + 2)
#define                                 PMDCCP5_bit         _BIT_ACCESS(PMDIS3,2)
// PMDIS3<PMDCCP6>
extern volatile __bit                   PMDCCP6             __at(0x75E3);	// @ (0xEBC * 8 + 3)
#define                                 PMDCCP6_bit         _BIT_ACCESS(PMDIS3,3)
// PMDIS3<PMDCCP7>
extern volatile __bit                   PMDCCP7             __at(0x75E4);	// @ (0xEBC * 8 + 4)
#define                                 PMDCCP7_bit         _BIT_ACCESS(PMDIS3,4)
// PMDIS3<PMDCCP8>
extern volatile __bit                   PMDCCP8             __at(0x75E5);	// @ (0xEBC * 8 + 5)
#define                                 PMDCCP8_bit         _BIT_ACCESS(PMDIS3,5)
// PMDIS3<PMDCCP9>
extern volatile __bit                   PMDCCP9             __at(0x75E6);	// @ (0xEBC * 8 + 6)
#define                                 PMDCCP9_bit         _BIT_ACCESS(PMDIS3,6)
// PMDIS2<PMDCMP1>
extern volatile __bit                   PMDCMP1             __at(0x75D8);	// @ (0xEBB * 8 + 0)
#define                                 PMDCMP1_bit         _BIT_ACCESS(PMDIS2,0)
// PMDIS2<PMDCMP2>
extern volatile __bit                   PMDCMP2             __at(0x75D9);	// @ (0xEBB * 8 + 1)
#define                                 PMDCMP2_bit         _BIT_ACCESS(PMDIS2,1)
// PMDIS2<PMDCMP3>
extern volatile __bit                   PMDCMP3             __at(0x75DA);	// @ (0xEBB * 8 + 2)
#define                                 PMDCMP3_bit         _BIT_ACCESS(PMDIS2,2)
// PMDIS1<PMDCTMU>
extern volatile __bit                   PMDCTMU             __at(0x75D6);	// @ (0xEBA * 8 + 6)
#define                                 PMDCTMU_bit         _BIT_ACCESS(PMDIS1,6)
// PMDIS0<PMDECCP1>
extern volatile __bit                   PMDECCP1            __at(0x75CD);	// @ (0xEB9 * 8 + 5)
#define                                 PMDECCP1_bit        _BIT_ACCESS(PMDIS0,5)
// PMDIS0<PMDECCP2>
extern volatile __bit                   PMDECCP2            __at(0x75CE);	// @ (0xEB9 * 8 + 6)
#define                                 PMDECCP2_bit        _BIT_ACCESS(PMDIS0,6)
// PMDIS0<PMDECCP3>
extern volatile __bit                   PMDECCP3            __at(0x75CF);	// @ (0xEB9 * 8 + 7)
#define                                 PMDECCP3_bit        _BIT_ACCESS(PMDIS0,7)
// PMDIS0<PMDMSSP1>
extern volatile __bit                   PMDMSSP1            __at(0x75C9);	// @ (0xEB9 * 8 + 1)
#define                                 PMDMSSP1_bit        _BIT_ACCESS(PMDIS0,1)
// PMDIS0<PMDMSSP2>
extern volatile __bit                   PMDMSSP2            __at(0x75CA);	// @ (0xEB9 * 8 + 2)
#define                                 PMDMSSP2_bit        _BIT_ACCESS(PMDIS0,2)
// PMDIS1<PMDPSP>
extern volatile __bit                   PMDPSP              __at(0x75D7);	// @ (0xEBA * 8 + 7)
#define                                 PMDPSP_bit          _BIT_ACCESS(PMDIS1,7)
// PMDIS1<PMDRTCC>
extern volatile __bit                   PMDRTCC             __at(0x75D5);	// @ (0xEBA * 8 + 5)
#define                                 PMDRTCC_bit         _BIT_ACCESS(PMDIS1,5)
// PMDIS1<PMDTMR1>
extern volatile __bit                   PMDTMR1             __at(0x75D1);	// @ (0xEBA * 8 + 1)
#define                                 PMDTMR1_bit         _BIT_ACCESS(PMDIS1,1)
// PMDIS1<PMDTMR2>
extern volatile __bit                   PMDTMR2             __at(0x75D2);	// @ (0xEBA * 8 + 2)
#define                                 PMDTMR2_bit         _BIT_ACCESS(PMDIS1,2)
// PMDIS1<PMDTMR3>
extern volatile __bit                   PMDTMR3             __at(0x75D3);	// @ (0xEBA * 8 + 3)
#define                                 PMDTMR3_bit         _BIT_ACCESS(PMDIS1,3)
// PMDIS1<PMDTMR4>
extern volatile __bit                   PMDTMR4             __at(0x75D4);	// @ (0xEBA * 8 + 4)
#define                                 PMDTMR4_bit         _BIT_ACCESS(PMDIS1,4)
// PMDIS2<PMDTMR5>
extern volatile __bit                   PMDTMR5             __at(0x75DB);	// @ (0xEBB * 8 + 3)
#define                                 PMDTMR5_bit         _BIT_ACCESS(PMDIS2,3)
// PMDIS2<PMDTMR6>
extern volatile __bit                   PMDTMR6             __at(0x75DC);	// @ (0xEBB * 8 + 4)
#define                                 PMDTMR6_bit         _BIT_ACCESS(PMDIS2,4)
// PMDIS2<PMDTMR8>
extern volatile __bit                   PMDTMR8             __at(0x75DE);	// @ (0xEBB * 8 + 6)
#define                                 PMDTMR8_bit         _BIT_ACCESS(PMDIS2,6)
// PMDIS0<PMDUART1>
extern volatile __bit                   PMDUART1            __at(0x75CB);	// @ (0xEB9 * 8 + 3)
#define                                 PMDUART1_bit        _BIT_ACCESS(PMDIS0,3)
// PMDIS0<PMDUART2>
extern volatile __bit                   PMDUART2            __at(0x75CC);	// @ (0xEB9 * 8 + 4)
#define                                 PMDUART2_bit        _BIT_ACCESS(PMDIS0,4)
// PORTB<PMPBE>
extern volatile __bit                   PMPBE               __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 PMPBE_bit           _BIT_ACCESS(PORTB,1)
// PORTE<PMPCS>
extern volatile __bit                   PMPCS               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 PMPCS_bit           _BIT_ACCESS(PORTE,2)
// PMCONH<PMPEN>
extern volatile __bit                   PMPEN               __at(0x7AFF);	// @ (0xF5F * 8 + 7)
#define                                 PMPEN_bit           _BIT_ACCESS(PMCONH,7)
// PIE1<PMPIE>
extern volatile __bit                   PMPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PMPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PMPIF>
extern volatile __bit                   PMPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PMPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PMPIP>
extern volatile __bit                   PMPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PMPIP_bit           _BIT_ACCESS(IPR1,7)
// PORTE<PMPRD>
extern volatile __bit                   PMPRD               __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 PMPRD_bit           _BIT_ACCESS(PORTE,0)
// PADCFG1<PMPTTL>
extern volatile __bit                   PMPTTL              __at(0x79E0);	// @ (0xF3C * 8 + 0)
#define                                 PMPTTL_bit          _BIT_ACCESS(PADCFG1,0)
// PORTE<PMPWR>
extern volatile __bit                   PMPWR               __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 PMPWR_bit           _BIT_ACCESS(PORTE,1)
// PORTE<PMRD>
extern volatile __bit                   PMRD                __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 PMRD_bit            _BIT_ACCESS(PORTE,0)
// PORTE<PMWR>
extern volatile __bit                   PMWR                __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 PMWR_bit            _BIT_ACCESS(PORTE,1)
// RCON<POR>
extern volatile __bit                   POR                 __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(RCON,1)
// UCFG<PPB0>
extern volatile __bit                   PPB0                __at(0x79C8);	// @ (0xF39 * 8 + 0)
#define                                 PPB0_bit            _BIT_ACCESS(UCFG,0)
// UCFG<PPB1>
extern volatile __bit                   PPB1                __at(0x79C9);	// @ (0xF39 * 8 + 1)
#define                                 PPB1_bit            _BIT_ACCESS(UCFG,1)
// USTAT<PPBI>
extern volatile __bit                   PPBI                __at(0x7B21);	// @ (0xF64 * 8 + 1)
#define                                 PPBI_bit            _BIT_ACCESS(USTAT,1)
// UCON<PPBRST>
extern volatile __bit                   PPBRST              __at(0x7B2E);	// @ (0xF65 * 8 + 6)
#define                                 PPBRST_bit          _BIT_ACCESS(UCON,6)
// OSCCON2<PRISD>
extern volatile __bit                   PRISD               __at(0x7C3A);	// @ (0xF87 * 8 + 2)
#define                                 PRISD_bit           _BIT_ACCESS(OSCCON2,2)
// T0CON<PSA>
extern volatile __bit                   PSA                 __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(T0CON,3)
// PMCONH<PSIDL>
extern volatile __bit                   PSIDL               __at(0x7AFD);	// @ (0xF5F * 8 + 5)
#define                                 PSIDL_bit           _BIT_ACCESS(PMCONH,5)
// PIE1<PSPIE>
extern volatile __bit                   PSPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PSPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PSPIF>
extern volatile __bit                   PSPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PSPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PSPIP>
extern volatile __bit                   PSPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PSPIP_bit           _BIT_ACCESS(IPR1,7)
// PMDIS1<PSPMD>
extern volatile __bit                   PSPMD               __at(0x75D7);	// @ (0xEBA * 8 + 7)
#define                                 PSPMD_bit           _BIT_ACCESS(PMDIS1,7)
// ECCP1AS<PSS1AC0>
extern volatile __bit                   PSS1AC0             __at(0x7DF2);	// @ (0xFBE * 8 + 2)
#define                                 PSS1AC0_bit         _BIT_ACCESS(ECCP1AS,2)
// ECCP1AS<PSS1AC1>
extern volatile __bit                   PSS1AC1             __at(0x7DF3);	// @ (0xFBE * 8 + 3)
#define                                 PSS1AC1_bit         _BIT_ACCESS(ECCP1AS,3)
// ECCP1AS<PSS1BD0>
extern volatile __bit                   PSS1BD0             __at(0x7DF0);	// @ (0xFBE * 8 + 0)
#define                                 PSS1BD0_bit         _BIT_ACCESS(ECCP1AS,0)
// ECCP1AS<PSS1BD1>
extern volatile __bit                   PSS1BD1             __at(0x7DF1);	// @ (0xFBE * 8 + 1)
#define                                 PSS1BD1_bit         _BIT_ACCESS(ECCP1AS,1)
// ECCP2AS<PSS2AC0>
extern volatile __bit                   PSS2AC0             __at(0x7DC2);	// @ (0xFB8 * 8 + 2)
#define                                 PSS2AC0_bit         _BIT_ACCESS(ECCP2AS,2)
// ECCP2AS<PSS2AC1>
extern volatile __bit                   PSS2AC1             __at(0x7DC3);	// @ (0xFB8 * 8 + 3)
#define                                 PSS2AC1_bit         _BIT_ACCESS(ECCP2AS,3)
// ECCP2AS<PSS2BD0>
extern volatile __bit                   PSS2BD0             __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 PSS2BD0_bit         _BIT_ACCESS(ECCP2AS,0)
// ECCP2AS<PSS2BD1>
extern volatile __bit                   PSS2BD1             __at(0x7DC1);	// @ (0xFB8 * 8 + 1)
#define                                 PSS2BD1_bit         _BIT_ACCESS(ECCP2AS,1)
// ECCP3AS<PSS3AC0>
extern volatile __bit                   PSS3AC0             __at(0x78CA);	// @ (0xF19 * 8 + 2)
#define                                 PSS3AC0_bit         _BIT_ACCESS(ECCP3AS,2)
// ECCP3AS<PSS3AC1>
extern volatile __bit                   PSS3AC1             __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 PSS3AC1_bit         _BIT_ACCESS(ECCP3AS,3)
// ECCP3AS<PSS3BD0>
extern volatile __bit                   PSS3BD0             __at(0x78C8);	// @ (0xF19 * 8 + 0)
#define                                 PSS3BD0_bit         _BIT_ACCESS(ECCP3AS,0)
// ECCP3AS<PSS3BD1>
extern volatile __bit                   PSS3BD1             __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 PSS3BD1_bit         _BIT_ACCESS(ECCP3AS,1)
// PMCONH<PTBEEN>
extern volatile __bit                   PTBEEN              __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 PTBEEN_bit          _BIT_ACCESS(PMCONH,2)
// PMEL<PTEN0>
extern volatile __bit                   PTEN0               __at(0x7AB0);	// @ (0xF56 * 8 + 0)
#define                                 PTEN0_bit           _BIT_ACCESS(PMEL,0)
// PMEL<PTEN1>
extern volatile __bit                   PTEN1               __at(0x7AB1);	// @ (0xF56 * 8 + 1)
#define                                 PTEN1_bit           _BIT_ACCESS(PMEL,1)
// PMEH<PTEN10>
extern volatile __bit                   PTEN10              __at(0x7ABA);	// @ (0xF57 * 8 + 2)
#define                                 PTEN10_bit          _BIT_ACCESS(PMEH,2)
// PMEH<PTEN11>
extern volatile __bit                   PTEN11              __at(0x7ABB);	// @ (0xF57 * 8 + 3)
#define                                 PTEN11_bit          _BIT_ACCESS(PMEH,3)
// PMEH<PTEN12>
extern volatile __bit                   PTEN12              __at(0x7ABC);	// @ (0xF57 * 8 + 4)
#define                                 PTEN12_bit          _BIT_ACCESS(PMEH,4)
// PMEH<PTEN13>
extern volatile __bit                   PTEN13              __at(0x7ABD);	// @ (0xF57 * 8 + 5)
#define                                 PTEN13_bit          _BIT_ACCESS(PMEH,5)
// PMEH<PTEN14>
extern volatile __bit                   PTEN14              __at(0x7ABE);	// @ (0xF57 * 8 + 6)
#define                                 PTEN14_bit          _BIT_ACCESS(PMEH,6)
// PMEH<PTEN15>
extern volatile __bit                   PTEN15              __at(0x7ABF);	// @ (0xF57 * 8 + 7)
#define                                 PTEN15_bit          _BIT_ACCESS(PMEH,7)
// PMEL<PTEN2>
extern volatile __bit                   PTEN2               __at(0x7AB2);	// @ (0xF56 * 8 + 2)
#define                                 PTEN2_bit           _BIT_ACCESS(PMEL,2)
// PMEL<PTEN3>
extern volatile __bit                   PTEN3               __at(0x7AB3);	// @ (0xF56 * 8 + 3)
#define                                 PTEN3_bit           _BIT_ACCESS(PMEL,3)
// PMEL<PTEN4>
extern volatile __bit                   PTEN4               __at(0x7AB4);	// @ (0xF56 * 8 + 4)
#define                                 PTEN4_bit           _BIT_ACCESS(PMEL,4)
// PMEL<PTEN5>
extern volatile __bit                   PTEN5               __at(0x7AB5);	// @ (0xF56 * 8 + 5)
#define                                 PTEN5_bit           _BIT_ACCESS(PMEL,5)
// PMEL<PTEN6>
extern volatile __bit                   PTEN6               __at(0x7AB6);	// @ (0xF56 * 8 + 6)
#define                                 PTEN6_bit           _BIT_ACCESS(PMEL,6)
// PMEL<PTEN7>
extern volatile __bit                   PTEN7               __at(0x7AB7);	// @ (0xF56 * 8 + 7)
#define                                 PTEN7_bit           _BIT_ACCESS(PMEL,7)
// PMEH<PTEN8>
extern volatile __bit                   PTEN8               __at(0x7AB8);	// @ (0xF57 * 8 + 0)
#define                                 PTEN8_bit           _BIT_ACCESS(PMEH,0)
// PMEH<PTEN9>
extern volatile __bit                   PTEN9               __at(0x7AB9);	// @ (0xF57 * 8 + 1)
#define                                 PTEN9_bit           _BIT_ACCESS(PMEH,1)
// PMCONH<PTRDEN>
extern volatile __bit                   PTRDEN              __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 PTRDEN_bit          _BIT_ACCESS(PMCONH,0)
// PMCONH<PTWREN>
extern volatile __bit                   PTWREN              __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 PTWREN_bit          _BIT_ACCESS(PMCONH,1)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit                   RA2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit                   RA3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA5>
extern volatile __bit                   RA5                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit                   RA6                 __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit                   RA7                 __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit                   RB0                 __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit                   RB1                 __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit                   RB2                 __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit                   RB3                 __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit                   RB4                 __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit                   RB5                 __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit                   RB6                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit                   RB7                 __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// INTCON<RBIE>
extern volatile __bit                   RBIE                __at(0x7F93);	// @ (0xFF2 * 8 + 3)
#define                                 RBIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<RBIF>
extern volatile __bit                   RBIF                __at(0x7F90);	// @ (0xFF2 * 8 + 0)
#define                                 RBIF_bit            _BIT_ACCESS(INTCON,0)
// INTCON2<RBIP>
extern volatile __bit                   RBIP                __at(0x7F88);	// @ (0xFF1 * 8 + 0)
#define                                 RBIP_bit            _BIT_ACCESS(INTCON2,0)
// INTCON2<RBPU>
extern volatile __bit                   RBPU                __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 RBPU_bit            _BIT_ACCESS(INTCON2,7)
// PORTC<RC0>
extern volatile __bit                   RC0                 __at(0x7C10);	// @ (0xF82 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit                   RC1                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PIE1<RC1IE>
extern volatile __bit                   RC1IE               __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RC1IE_bit           _BIT_ACCESS(PIE1,5)
// PIR1<RC1IF>
extern volatile __bit                   RC1IF               __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RC1IF_bit           _BIT_ACCESS(PIR1,5)
// IPR1<RC1IP>
extern volatile __bit                   RC1IP               __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RC1IP_bit           _BIT_ACCESS(IPR1,5)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
